{"slug":"2021-02-13-a-guide-for-simple-presentations","filename":"2021-02-13-a-guide-for-simple-presentations","title":"A guide for simple presentations","date":"Sat, 13 Feb 2021 00:00:00 GMT","draft":false,"meta":{"title":"A guide for simple presentations","date":"2021-02-13T00:00:00.000Z"},"body":"<p><img src=\"/public/assets/images/keynote.webp\" alt=\"Keynote screenshot\" width=\"2904\" height=\"1456\" onload=\"this.style.opacity=1\" loading=\"lazy\"/></p>\n<h2>1. Know your audience</h2>\n<p>It might seem obvious, but that's the <strong>#1 problem</strong> with most presentations, especially internal or technical ones. We tend to bloat our presentations with information that's <strong>unnecessary for our audience</strong> while paradoxically <strong>not being forgiving to people that don't start at the same level of information as we do</strong>.</p>\n<p><strong>Who are you talking to?</strong> Are you sure they know your <a href=\"/blog/2021-01-14-industry-dialects/\">jargon</a>? What depth are your taking them to in your explanation?</p>\n<p>Be forgiving to people whose knowledge is focused on something else than yours by <strong>summing up the essentials</strong>, that's also useful for people who are familiar as it helps them immediately <strong>contextualize</strong>.</p>\n<p>Don't go over unnecessary, overly complex explanations, you might loose people on that. At each step, ask yourself: <strong>is this a necessary information</strong> to proceed? Some things might <em>feel</em> important to <em>you</em>, but aren't to your audience. Be empathetic.</p>\n<h2>2. Make the information flow naturally</h2>\n<p>As much as possible, make your presentation follow a <strong>logical path</strong>, a <strong>plan</strong>. The more natural it feels, the more your audience is going to be focused.</p>\n<p>It's actually a good thing if people can guess what's next in your presentation, it means you're on the same page!</p>\n<h2>3. Don't put too much in a slide</h2>\n<p>A common error, especially on presentations giving details about a specific topic, is too overcrowd your slides.</p>\n<p>You're making a presentation or a PDF to make information simpler to grasp than with boring old text : <strong>continous, long lines of prose don't work in that context</strong>.</p>\n<p>If you need to manipulate complex ideas: <strong>go step by step</strong> and introduce concepts individually in separate slides, then <strong>simplify</strong> their reprentation in further slides.</p>\n<p>You should end up with only two types of slides:</p>\n<ul>\n<li><strong>enumerations</strong>, where you list facts, advantages, pain points</li>\n<li><strong>emphases</strong>, where you mark a pause on a specific information</li>\n</ul>\n<h2>4. Represent information visually</h2>\n<p>If you create a presentation and just put sentences next to a picture, you're not using any of the medium's benefit.</p>\n<p>What these tools can bring is a way to represent information <strong>visually</strong> instead of textually. The idea of a presentation is that <strong>seing the slides should give you a general idea</strong>, and listening to the pitch should give you a deeper understanding of it.</p>\n<p>Use <strong>blocks</strong>, <strong>arrows</strong> &amp; <strong>colors</strong> to represent the relationships between concepts and ideas, use layout to magnify the important stuff.</p>\n<h2>5. Leverage animations*</h2>\n<p><em>* but don't depend on them</em></p>\n<p>When on <strong>enumeration</strong> slides, you might want people to focus on one thing at a time. Using progressive delivery can help that, make the items arrive with your speech.</p>\n<p>If individual items depend on each other, <strong>use animations</strong> to imply that relationship. I usually make the &quot;source&quot; item appear using a <strong>spontaneous animation</strong> (fading and scaling from its center), and the items depending on it using <strong>directional animations</strong> (fading and moving from its dependency). Those details can subtly improve the understandability of your slides.</p>\n<p>That said, <strong>don't depend</strong> on animations. Your deck is probably going to end up shared in a PDF document, where you can't rely on them. See animations as <strong>progressive enhancement</strong>, your slides should work without them.</p>\n<h2>6. Never use PowerPoint</h2>\n<p>PowerPoint claims it does animations. It doesn't. They're not configurable and always end up looking bad.</p>\n<p>It might be <a href=\"https://www.youtube.com/watch?v=uNjxe8ShM-8\">Turing complete</a> but that's not what we're looking for when we want to share information in the most efficient and compelling way. Don't ever use PowerPoint if you want your deck to look good</p>\n<h2>7. Write Presenter Notes</h2>\n<p>If you're planning on delivering a pitch with your slides, <strong>write notes</strong>.</p>\n<p>Notes will help you remembering your flow, your punchlines, and they're a great support for onboarding people: they get to read and learn the original pitch if you're in a corporate context.</p>\n<hr />\n<p>That's about it. I hope these little tips can help 😊</p>\n"}