{"slug":"2021-03-30-google-rather-break-your-ads-than-be-privacy-friendly","filename":"2021-03-30-google-rather-break-your-ads-than-be-privacy-friendly","title":"Google rather break your ads than be privacy-friendly","date":"Tue, 30 Mar 2021 00:00:00 GMT","draft":false,"meta":{"title":"Google rather break your ads than be privacy-friendly","date":"2021-03-30T00:00:00.000Z"},"body":"<h2>A little bit on EU regulations</h2>\n<p>In 2016, the <strong>General Data Protection Regulation</strong> (or GDPR for short) was voted in the EU. In short, it's a set of regulations for data collection and processing, and one of the most impactful changes it brings is that collecting <strong>personal data</strong> requires an <strong>explicit consent</strong> from the user.</p>\n<p>The way the ad industry responded, throught the <strong>Internet Advertising Bureau</strong> (IAB), was to create a common framework called the <strong>Transparency &amp; Consent Framework</strong> (TCF).</p>\n<p>This framework specifies a common ground for all actors in the ad industry, through an API:</p>\n<ul>\n<li>for <strong>Consent Management Platforms</strong> (CMPs, the folks providing the cookie banners) to provide</li>\n<li>for every other actor to consume</li>\n</ul>\n<p>When a user arrives on the page and sets their cookie preferences, the API gives you two informations:</p>\n<ul>\n<li>Does the GDPR apply here?</li>\n<li>Here's what the user has or hasn't consented to</li>\n</ul>\n<h2>April 1st in the EU</h2>\n<p>There's a <strong>major issue</strong> with the current state of these cookie banners: <strong>they are full of UX dark patterns</strong>:</p>\n<ul>\n<li>There's a big <strong>Accept all</strong> button, but in order to refuse you need to uncheck a dozen checkboxes</li>\n<li>You're most of the time giving a consent for a list of <strong>1500+ companies</strong> you never ever heard of (because there's no way to tell which ones will be involved in an ad loaded later)</li>\n</ul>\n<p>That's why on April 1st, the French regulator responsible for the GPDR application starts enforcing the notion of <strong>explicit consent</strong>, and explained that these dark patterns could no longer stand.</p>\n<p>What's going to happen is that most Consent Management Platforms are going to implement a <strong>Refuse All</strong> button. Some publishers already took action and added it, which lowers lowers the consent rate from a staggering ~100% to ~70% (surprising! when the &quot;refuse&quot; option doesn't take 10x more time than the &quot;accept&quot; one, you're giving the choice back to users!).</p>\n<p>Which brings us to …</p>\n<h2>The surprising case of Google</h2>\n<p>A typical ad campaign generally has <strong>tracking pixels</strong> (to verify how many users have seen your ads) and <strong>redirect links</strong> (to count how many users clicked on your ad).</p>\n<p>Google has a great toolbox for advertisers and is widely used for these bits. That's the <code>doubleclick</code> pixels you'll generally see in your network requests.</p>\n<p>With the GDPR, these pixels and redirect links now take two parameters:</p>\n<ul>\n<li><code>gdpr</code>: does the GDPR apply?</li>\n<li><code>gdpr_consent</code>: the list of consents the user gave</li>\n</ul>\n<p>These parameters give to the tracker the information about what they can or cannot do. Can they drop a cookie? Can they save personal data?</p>\n<p>Most actors in that field don't need any of that to work, but with Google tracking, the story is different. If the GDPR applies and the user refused to give any consent, Google stops operating.</p>\n<p>That means that even if your ad doesn't require any personal data and is displayed to a used who refused personal data collection, Google will:</p>\n<ul>\n<li><strong>not count your ad views</strong></li>\n<li><strong>redirect people who clicked on your ad to an <code>about:blank</code> page</strong></li>\n</ul>\n<p>Given Google tools popularity on the market, what they're doing is making unaddressable ~30% (likely to be more in the future) of the EU traffic whenever their tools are used: <strong>there's no point showing an ad to someone who's going to end up on a broken link if they decide to engage with it</strong>.</p>\n<p>Given most actors in the ad tracking/trust industry work without cookies or personal data, it's safe to assume that a company with Google's wealth has the means to make it work that way. Instead, it seems like <strong>Google rather break your ads than be privacy-friendly</strong>.</p>\n"}