{"slug":"2021-01-14-industry-dialects","filename":"2021-01-14-industry-dialects","title":"Industry dialects","date":"Thu, 14 Jan 2021 00:00:00 GMT","draft":false,"meta":{"title":"Industry dialects","date":"2021-01-14T00:00:00.000Z"},"body":"<p>From the wording of an action button to the general tone we use, the <strong>way we communicate</strong> to our users textually is <strong>part of design</strong>.</p>\n<p>You're more likely to find a <em>Publish</em> button than a <em>Set the publish flag to true and push the item into that cache over there</em> one, and while we have that <strong>simplification care</strong> we put in our products, we generally don't apply these principles to our work life.</p>\n<p>We have dialects. Lots of them.</p>\n<p>I'm a software developer in an advertising company, so I need to be familiar with both the technical and advertising dialects, and often need to use them to communicate with my colleagues. Same would go for many industries.</p>\n<h2>Dialects are good</h2>\n<p>Internally in a company, putting words in front of complex ideas &amp; concepts is <strong>incredibly useful</strong> when everyone is on the same page. As our <strong>internal language</strong> grows, so is the common ground that enable us to communicate quickly and manipulate increasingly complex ideas without turning our sentences into Kant-style ones.</p>\n<p>Jargon can be thought as a programming variable, shared in a scope being the people knowing what it means. It's a communication abstraction that we use.</p>\n<h2>Dialects are bad</h2>\n<p>When I started to grasp the online advertising jargon, I was lost. This industry's dialect is probably one of the worst I've ever seen. Most people only speak with acronyms or words that don't mean anything out of context, or even acronyms <strong>of</strong> words that don't mean anything out of context. On occasions, I've seen people using these terms in such ways that they couldn't possibly know what they meant.</p>\n<p>Enter the language of bullshit.</p>\n<p>Sure, I can see the appeal for bad actors, they get to sell abstract concepts behind shiny new terms or acronyms that no one dares to ask the meaning of because they don't want to look stupid (when you don't understand, always ask! It's never stupid to admit you don't know something so that you can learn it).</p>\n<p>One bad side effect jargon can also have is influencing the way we think about what they refer to. Language influences the way you think. Like any abstraction, dialects can turn simple concepts into black boxes, <strong>giving less opportunity for people to think about a given problem with the best understanding they can</strong>.</p>\n<p>It's always better to have more people understanding something. People not in your industry can question things you assumed to be right, but never questionned because they seemed obvious to you.</p>\n<p>Dialects can even misdirect: when I started working in advertising, I though that an <strong>ad impression</strong> meant that a user had seen an ad, as in &quot;the ad made an impression on the user&quot; (as a non-native english speaker, that doesn't shock me). Well it's not. It means that an ad has rendered on the page. &quot;Impression&quot; refers to the French word for &quot;printing&quot;. We use a printed-press analogy as a terminology for online ads. That's the floppy disk icon of online advertising.</p>\n<p>That's just a funny example, but industries are full of terms like this. Overusing jargon can make your industry hostile to newcomers.</p>\n<h2>How do fix that?</h2>\n<p>First, <strong>keep using dialects when efficient</strong>. It's a great tool, it's even necessary at times.</p>\n<p>Second, when coming up with new terms, <strong>mark a pause</strong>:</p>\n<ul>\n<li>if the concept takes the same amount of time to explain than the term you're inventing, cancel</li>\n<li>find a name that's <strong>immediately descriptive</strong>, so that people don't need a dictionary when they meet such terms</li>\n<li><strong>try to limit misdirection</strong>, simplification can be hard, but make sure that the term you're coming up with doesn't give too much room to bad interpretations</li>\n</ul>\n<p>Third, put yourself in others' shoes:</p>\n<ul>\n<li>don't impose your jargon when not necessary</li>\n<li>summarise the concepts that the person you're talking to needs to understand instead (if you can't explain a concept, it generally means that you didn't understand it, so that exercice is beneficial for you too)</li>\n</ul>\n<p>And sometimes, question these terms, expand them. Find better, more descriptive ones, stop using them if they're confusing. The name you came up with a few months ago might be misleading to others.</p>\n<p>Repeating concepts isn't as bad as it seems.</p>\n<p>My rule of thumb would be: <strong>always aim for the lowest common denominator between you and the person you're talking to have</strong>, and when in doubt about that denominator, replace your fancy jargon with a simple explanation.</p>\n"}