{"slug":"2025-04-23-principles-for-maintainable-codebases","filename":"2025-04-23-principles-for-maintainable-codebases","title":"Principles for maintainable codebases","date":"Wed, 23 Apr 2025 00:00:00 GMT","draft":false,"meta":{"title":"Principles for maintainable codebases","date":"2025-04-23T00:00:00.000Z"},"body":"<h2>Write dumb code</h2>\n<p>Write code that's easy to understand, don't try to be a smartass that writes clever one-liners or using hidden heuristics only the author knows about (detailed in this <a href=\"/blog/2021-01-09-write-dumb-code/\">previous article</a>).</p>\n<h2>Keep an explicit data flow</h2>\n<p>Don't use magic tools to inject dependencies or values, just pass your dependencies to your functions.</p>\n<p>In most codebases, the only things you want to inject turn out to be a very minimal set of data (a database ref, a few vendor SDKs to mock), it's completely fine instantiating your dependencies yourself and passing them down explicitly where they're used.</p>\n<h2>Low overhead</h2>\n<p>Use the language concepts and features rather than re-creating them: <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Modules\">modules</a>, <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Functions\">functions</a>, <a href=\"https://www.typescriptlang.org\">types</a>. Keep your dependencies to the minimum.</p>\n<p>If your framework has its own module system, drop it immediately.</p>\n<h2>No over abstraction</h2>\n<p>Don't create abstractions before a need emerges. There's no one-rule-fits-all on this.</p>\n<p>We like anticipating situations that won't happen in the foreseable future and end up paying the price of maintaining increasingly complex systems that probably won't ever serve a purpose.</p>\n<h2>Cohesive responsibilities</h2>\n<p>Keep responsibilities cohesive rather than spreading them in different parts of the codebase. The app structure should roughly reflect its public API.</p>\n<p>Applying outdated <em>wisdom</em> from 2000s programming books, we tend to mixup technical nature and concern, and end up with codebases that require a huge mental overhead because a simple feature relies on code that's scattered across dozens of files that are split by type rather than grouped by purpose.</p>\n<p>Your concern should be to have a consistent feature.</p>\n<h2>Explorable codebase</h2>\n<p>The codebase should be understandable without external context and have explicit links between modules. It should be easy to find the desired module starting from the entry point.</p>\n<p>This is essential for debugging. If you're using a framework that auto-instanciates and binds some part of the system automatically, you'll have a really bad time onboarding people and getting them to debug the system.</p>\n<h2>Quick feedback loop</h2>\n<p>Running the app locally or running your test should be easy and fast to have a quick feedback loop in your development environment.</p>\n<p>People work in different ways, some are more efficient by using TDD, some by running good old calls to iterate. Your system should allow for both. You want to provide a good DX for your team rather than coercing them into using something they might not be confortable with.</p>\n<p>Another area where a quick feedback loop is important is the time it takes for your CI to deploy your app. Always improve on this, ship as often as you can.</p>\n<h2>Test boundaries, not internals</h2>\n<p>Don't waste your energy in writing thousand of unit tests. Write most tests in an end-to-end style, testing the IO of the boudaries of your application (API, incoming messages).</p>\n<p>Unit testing the internals is very valuable when dealing with really complex isolated bits, and they should be used there.</p>\n<p>Nonetheless, in most web applications, most of the value you can extract is by testing against the public API on a fully isolated app instance for each test (no manual setup, writing tests is fast, tests will be more stable over time, give you some form of dogfooding on how the API is consumed).</p>\n<h2>Stop the microservices madness</h2>\n<p>Always start with a monolith, only split if you have an extremely good reason for it (independant release cycles between teams is not one of them).</p>\n<p>We rarely anticipate the burden of complexity that microservices get. What's trivial with a single application (like popping a preview deployment for a development branch) becomes a problem you need dedicated teams for.</p>\n<h2>Use the compiler</h2>\n<p>When the language you're using provides you with a decent type system, embed as many properties as you can directly in your modeling. Making something illegal in a program is less of an effort than testing it manually.</p>\n<h2>Ask why</h2>\n<p>This is likely the most important principle: always ask why. Always question.</p>\n<p>If you don't understand the value of some widely adopted &quot;best practice&quot;, dig into it.</p>\n<p>Most times, people apply these practices because it was written in a book, so <em>it must be true</em>. If you're wondering why something was implemented in a curious way, get to understand the properties that the implemented wanted to guarantee, and start thinking from there.</p>\n<p>Each situation is unique, your team composition, the product you're building, the technology evolutions that happened since then.</p>\n<p>Reassess all the time.</p>\n"}